:PROPERTIES:
:ID:       7be4c876-4b75-465c-a734-1445188eab96
:END:
#+title: NixOS

* Installation
** Initial Partition Prep
There needs to be at least three partitions:
| Name  | Size           | Filesystem | Flags    |
|-------+----------------+------------+----------|
| efi   | 1GiB           | fat32      | esp,boot |
| swap  | $available_ram | linux-swap |          |
| nixos | $unused_space  | xfs        |          |
* Nixpkgs
** Checking channels
#+begin_src shell :dir /sudo::
  nix-channel --list
#+end_src

#+RESULTS:
| home-manager | https://github.com/rycee/home-manager/archive/release-20.03.tar.gz |
| nixos        | https://nixos.org/channels/nixos-unstable                          |

* Nixlang
** Builtins
*** readDir PATH
Read PATH in as a string.
** Attrsets
*** nameValuePair NAME VALUE
Returns an attrset like {name=NAME; value=VALUE;}
*** mapAttrs FUNC ATTRSET
Runs FUNC over ATTRSET passing each key and value. FUNC should return new values for
each key.
*** mapAttrs' FUNC ATTRSET
Like =mapAttrs= but FUNC should return an attrset, like those returned from
=nameValuePair=, for each key-value pair in ATTRSET.

* Home-manager
** Installation

Add the channel
#+begin_src sh
  sudo nix-channel --add https://github.com/nix-community/home-manager/archive/master.tar.gz home-manager
  sudo nix-channel --update
#+end_src

** Scraps
*** Activation Packages
First import the dag module:
#+begin_src nix
  with import <home-manager/modules/lib/dag.nix> { inherit lib; };
#+end_src

Then add a new entry:
#+begin_src nix
  home.activation.ssh-personal = dagEntryAfter ["installPackages"] ''
    chmod 400 /Users/dustinlacewell/.ssh/personal
  '';
#+end_src

* How-tos
** Search for packages
#+begin_src shell
 nix-env -qaP '.*emacs.*'
#+end_src

** Force config merge ordering
#+begin_src nix
  systemd.services.znc.preStart = lib.mkBefore "echo 'foo'"
#+end_src

#+begin_src nix
  systemd.services.znc.preStart = lib.mkAfter "echo 'foo"
#+end_src

** Add nixpkgs or nixos fork as channel
#+begin_src text
  nix-channel --add https://github.com/LnL7/nixpkgs/archive/foo.tar.gz nixpkgs-foo
#+end_src

*
** Nix-shell shebangs
#+begin_src bash
  #! /usr/bin/env nix-shell
  #! nix-shell -i python3 -p python3 python34Packages.pygobject3 libnotify gobjectIntrospection gdk_pixbuf
#+end_src
** Install Derivation With nix-env
#+begin_src sh
  nix-env -f default.nix -i
#+end_src
** Get Hash of Store Path
#+begin_src sh
  nix-hash --type sha256 --base32 /nix/store/xxx
#+end_src
** Create a simple wrapper script
** Find Dependants Of Package
#+begin_src bash
nix-store --query --roots /nix/store/7dnsvya7hz0srvh4wrkyi6q2w36lgkf9-styx-0.7.1-lib
#+end_src

also nix-whydepends
** Using PatchELF on Electron Apps
https://qiita.com/kimagure/items/6e0fd0aad389c1f274c6
** Introduction to Flakes
https://www.tweag.io/blog/2020-05-25-flakes/
* Audio
** Jack
https://github.com/NixOS/nixpkgs/pull/93431#issuecomment-680828528
